app/controllers/application_controller.rb

    def user
        User.find(@uid)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def current_user
        @current_user = User.find_by(id: @uid)
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]