app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "second item"], ["content", nil], ["created_at", "2023-11-22 22:24:56.148668"], ["updated_at", "2023-11-22 22:24:56.148668"]]
---
    def create
        @post = Post.new(title: params[:title], content: params[:content])
        # @post.user = current_user
        respond_to do | format |
            if @post.save