app/controllers/posts_controller.rb

    def index
        @posts = Post.all.reverse
---
SELECT "posts".* FROM "posts"

    def show
        @post = Post.find(params[:id])
        @user = User.find(@post.user_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @user = session[:user_id]
        @post = Post.new(title: params[:title], content: params[:content], user_id: @user)
        respond_to do | format |
            if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Ianoz"], ["content", nil], ["user_id", 1], ["created_at", "2023-11-23 21:26:48.855940"], ["updated_at", "2023-11-23 21:26:48.855940"]]