app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["email", "test@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-11-22 18:42:40.672278"], ["updated_at", "2023-11-22 18:42:40.672278"]]